from decomposer import decompose

rule='''

-ㄹㄱ;,ㄷ- -ㄹ,ㅅㄷ-
-ㄹㄱ;,ㅂ- -ㄹ,ㅅㅂ-
-ㄹㄱ;,ㅅ- -ㄹ,ㅅㅆ-
-ㄹㄱ;,ㅈ- -ㄹ,ㅅㅈ-
-ㄹㅂ;,ㄷ- -ㅂ,ㅅㄷ-
-ㄹㅂ;,ㅂ- -ㅂ,ㅅㅂ-
-ㄹㅂ;,ㅅ- -ㅂ,ㅅㅆ-
-ㄹㅂ;,ㅈ- -ㅂ,ㅅㅈ-

,’ㄱ- ,’ㅅㄱ-
,’ㄷ- ,’ㅅㄷ-
,’ㅂ- ,’ㅅㅂ-
,’ㅅ- ,’ㅅㅆ-
,’ㅈ- ,’ㅅㅈ-

,=ㄱ- ,ㅅㄱ-
,=ㄷ- ,ㅅㄷ-
,=ㅂ- ,ㅅㅂ-
,=ㅅ- ,ㅅㅆ-
,=ㅈ- ,ㅅㅈ-

ㅏ,;렬 ㅏ,열
ㅑ,;렬 ㅑ,열
ㅓ,;렬 ㅓ,열
ㅕ,;렬 ㅕ,열
ㅗ,;렬 ㅗ,열
ㅛ,;렬 ㅛ,열
ㅜ,;렬 ㅜ,열
ㅠ,;렬 ㅠ,열
ㅡ,;렬 ㅡ,열
ㅣ,;렬 ㅣ,열
ㅐ,;렬 ㅐ,열
ㅒ,;렬 ㅒ,열
ㅔ,;렬 ㅔ,열
ㅖ,;렬 ㅖ,열
ㅚ,;렬 ㅚ,열
ㅟ,;렬 ㅟ,열
ㅢ,;렬 ㅢ,열
ㅘ,;렬 ㅘ,열
ㅝ,;렬 ㅝ,열
ㅙ,;렬 ㅙ,열
ㅞ,;렬 ㅞ,열
ㅏ,;률 ㅏ,율
ㅑ,;률 ㅑ,율
ㅓ,;률 ㅓ,율
ㅕ,;률 ㅕ,율
ㅗ,;률 ㅗ,율
ㅛ,;률 ㅛ,율
ㅜ,;률 ㅜ,율
ㅠ,;률 ㅠ,율
ㅡ,;률 ㅡ,율
ㅣ,;률 ㅣ,율
ㅐ,;률 ㅐ,율
ㅒ,;률 ㅒ,율
ㅔ,;률 ㅔ,율
ㅖ,;률 ㅖ,율
ㅚ,;률 ㅚ,율
ㅟ,;률 ㅟ,율
ㅢ,;률 ㅢ,율
ㅘ,;률 ㅘ,율
ㅝ,;률 ㅝ,율
ㅙ,;률 ㅙ,율
ㅞ,;률 ㅞ,율

,;랴 ,냐
,;려 ,녀
,;료 ,뇨
,;류 ,뉴
,;리 ,니
,;라 ,나
,;러 ,너
,;로 ,노
,;루 ,누
,;래 ,내
,;럐 ,냬
,;레 ,네
,;례 ,녜
,;뢰 ,뇌
,;냐 ,야
,;녀 ,여
,;뇨 ,요
,;뉴 ,유
,;니 ,이
,;냬 ,얘
,;녜 ,예

,의; ,에;
ㅏ,의 ㅏ,이
ㅑ,의 ㅑ,이
ㅓ,의 ㅓ,이
ㅕ,의 ㅕ,이
ㅗ,의 ㅗ,이
ㅛ,의 ㅛ,이
ㅜ,의 ㅜ,이
ㅠ,의 ㅠ,이
ㅡ,의 ㅡ,이
ㅣ,의 ㅣ,이
ㅐ,의 ㅐ,이
ㅒ,의 ㅒ,이
ㅔ,의 ㅔ,이
ㅖ,의 ㅖ,이
ㅚ,의 ㅚ,이
ㅟ,의 ㅟ,이
ㅢ,의 ㅢ,이
ㅘ,의 ㅘ,이
ㅝ,의 ㅝ,이
ㅙ,의 ㅙ,이
ㅞ,의 ㅞ,이
-ㅇ,의 -ㅇ,이



-ㄷ,이 ,지
-ㅌ,이 ,치
-ㄹㅌ,이 -ㄹ,치
-ㄷ,히 ,치

-ㄱ,ㅇ- ,ㄱ-
-ㄴ,ㅇ- ,ㄴ-
-ㄷ,ㅇ- ,ㄷ-
-ㄹ,ㅇ- ,ㄹ-
-ㅁ,ㅇ- ,ㅁ-
-ㅂ,ㅇ- ,ㅂ-
-ㅅ,ㅇ- ,ㅅ-
-ㅈ,ㅇ- ,ㅈ-
-ㅊ,ㅇ- ,ㅊ-
-ㅋ,ㅇ- ,ㅋ-
-ㅌ,ㅇ- ,ㅌ-
-ㅍ,ㅇ- ,ㅍ-
-ㄲ,ㅇ- ,ㄲ-
-ㅆ,ㅇ- ,ㅆ-

계, 게,
례, 레,
혜, 헤,

-ㄹㅂ,ㄱ- -ㄹ,ㅅㄱ-
-ㄹㅂ,ㄷ- -ㅂ,ㅅㄷ-
-ㄹㅂ,ㅅ- -ㅂ,ㅅㅅ-
-ㄹㅂ,ㅈ- -ㅂ,ㅅㅈ-
-ㄹㄱ,ㄱ- -ㄹ,ㅅㄱ-

-ㄱㅅ,ㅇ- -ㄱ,ㅅ-
-ㄹㄱ,ㅇ- -ㄹ,ㄱ-
-ㄹㅂ,ㅇ- -ㄹ,ㅂ-
-ㄹㅍ,ㅇ- -ㄹ,ㅍ-
-ㅂㅅ,ㅇ- -ㅂ,ㅅ-
-ㄹㅌ,ㅇ- -ㄹ,ㅌ-
-ㄹㅌ,ㄱ- -ㄹ,ㅅㄱ-
-ㄹㅌ,ㄷ- -ㅌ,ㅅㄷ-
-ㄹㅌ,ㅂ- -ㅌ,ㅅㅂ-
-ㄹㅌ,ㅅ- -ㅌ,ㅅㅆ-
-ㄹㅌ,ㅈ- -ㅌ,ㅅㅈ-
-ㄴㅈ,ㅇ- -ㄴ,ㅈ-
-ㄹㅎ,ㅇ- -ㄹ,ㅎ-
-ㄹㅎ,ㄱ- -ㄹ,ㅋ-
-ㄹㅎ,ㄴ- -ㄹ,ㄹㄹ-
-ㄹㅎ,ㄷ- -ㄹ,ㅌ-
옰,바 올,바
-ㄹㅎ,ㅅ- -ㄹ,ㅅㅆ-
-ㄹㅎ,ㅈ- -ㄹ,ㅅㅊ-
-ㄹㅁ,ㅇ- -ㄹ,ㅁ-
-ㄹㅁ,ㄱ- -ㅁ,ㅅㄱ-
-ㄹㅁ,ㄷ- -ㅁ,ㅅㄷ-
-ㄹㅁ,ㅂ- -ㅁ,ㅅㅂ-
-ㄹㅁ,ㅅ- -ㅁ,ㅅㅆ-
-ㄹㅁ,ㅈ- -ㅁ,ㅅㅈ-
-ㄴㅈ,ㅇ- -ㄴ,ㅈ-
-ㄴㅈ,ㄱ- -ㄴ,ㅅㄱ-
-ㄴㅈ,ㄷ- -ㄴ,ㅅㄷ-
-ㄴㅈ,ㅂ- -ㄴ,ㅅㅂ-
-ㄴㅈ,ㅅ- -ㄴ,ㅅㅆ-
-ㄴㅈ,ㅈ- -ㄴ,ㅅㅈ-
-ㄴㅎ,ㅇ- ,ㄴ-
-ㄴㅎ,ㄱ- -ㄴ,ㅋ-
-ㄴㅎ,ㄷ- -ㄴ,ㅌ-
-ㄴㅎ,ㅂ- -ㄴ,ㅍ-
-ㄴㅎ,ㅅ- -ㄴ,ㅅㅆ-
-ㄴㅎ,ㅈ- -ㄴ,ㅅㅈ-
-ㅎ,ㄱ- -ㄷ,ㅋ-
-ㅎ,ㄷ- -ㄷ,ㅌ-
-ㅎ,ㅂ- -ㄷ,ㅍ-
-ㅎ,ㅅ- -ㄷ,ㅅㅆ-
-ㅎ,ㅈ- -ㄷ,ㅅㅈ-
-ㅎ,ㄴ- -ㄴ,ㄴ-

-ㄱ,ㅎ- ,ㅋ-
-ㄷ,ㅎ- ,ㅌ-
-ㅂ,ㅎ- ,ㅍ-
-ㅈ,ㅎ- ,ㅊ-
-ㄴㅈ,ㅎ- -ㄴ,ㅊ-
-ㄹㄱ,ㅎ- -ㄹ,ㅋ-
-ㄹㅂ,ㅎ- -ㄹ,ㅍ-

-ㄴ,ㅎ- ,ㄴㅎ-
-ㄹ,ㅎ- ,ㄹㅎ-
-ㅁ,ㅎ- ,ㅁㅎ-

-ㄱ,ㄴ- -ㅇ,ㄴ-
-ㄱ,ㅁ- -ㅇ,ㅁ-
-ㄱ,ㄹ- -ㅇ,ㄹㄴ-
-ㄱㅅ,ㄴ- -ㄱ,ㄴ-
-ㄱㅅ,ㅁ- -ㄱ,ㅁ-
-ㄱㅅ,ㄹ- -ㄱ,ㄹㄴ-
-ㅋ,ㄴ- -ㅇ,ㄴ-
-ㅋ,ㅁ- -ㅇ,ㅁ-
-ㅋ,ㄹ- -ㅇ,ㄹㄴ-
-ㄲ,ㄴ- -ㅇ,ㄴ-
-ㄲ,ㅁ- -ㅇ,ㅁ-
-ㄲ,ㄹ- -ㅇ,ㄹㄴ-
-ㄹㄱ,ㄴ- -ㄹ,ㄴ-
-ㄹㄱ,ㅁ- -ㄹ,ㅁ-
-ㄹㄱ,ㄹ- -ㄹ,ㄹㄴ-

-ㄷ,ㄴ- -ㄴ,ㄴ-
-ㄷ,ㅁ- -ㄴ,ㅁ-
-ㄷ,ㄹ- -ㄴ,ㄹㄴ-
-ㅅ,ㄴ- -ㄴ,ㄴ-
-ㅅ,ㅁ- -ㄴ,ㅁ-
-ㅅ,ㄹ- -ㄴ,ㄹㄴ-
-ㅈ,ㄴ- -ㄴ,ㄴ-
-ㅈ,ㅁ- -ㄴ,ㅁ-
-ㅈ,ㄹ- -ㄴ,ㄹㄴ-
-ㅊ,ㄴ- -ㄴ,ㄴ-
-ㅊ,ㅁ- -ㄴ,ㅁ-
-ㅊ,ㄹ- -ㄴ,ㄹㄴ-
-ㅌ,ㄴ- -ㄴ,ㄴ-
-ㅌ,ㅁ- -ㄴ,ㅁ-
-ㅌ,ㄹ- -ㄴ,ㄹㄴ-
-ㅆ,ㄴ- -ㄴ,ㄴ-
-ㅆ,ㅁ- -ㄴ,ㅁ-
-ㅆ,ㄹ- -ㄴ,ㄹㄴ-

-ㄹㅂ,ㄴ- -ㅁ,ㄴ-
-ㄹㅂ,ㅁ- -ㅁ,ㅁ-
-ㄹㅂ,ㄹ- -ㅁ,ㄹㄴ-
-ㅂ,ㄴ- -ㅁ,ㄴ-
-ㅂ,ㅁ- -ㅁ,ㅁ-
-ㅂ,ㄹ- -ㅁ,ㄹㄴ-
-ㅂㅅ,ㄴ- -ㅁ,ㄴ-
-ㅂㅅ,ㅁ- -ㅁ,ㅁ-
-ㅂㅅ,ㄹ- -ㅁ,ㄹㄴ-
-ㅍ,ㄴ- -ㅁ,ㄴ-
-ㅍ,ㅁ- -ㅁ,ㅁ-
-ㅍ,ㄹ- -ㅁ,ㄹㄴ-

-ㄹ,ㄴ- -ㄹ,ㄹㄹ-
-ㄴ,ㄹ- -ㄴㄹ,ㄹㄹ-

-ㅁ,랴- -ㅁ,ㄹㅇ-ㅑ
-ㅁ,려- -ㅁ,ㄹㅇ-ㅕ
-ㅁ,료- -ㅁ,ㄹㅇ-ㅛ
-ㅁ,류- -ㅁ,ㄹㅇ-ㅠ
-ㅁ,ㄹ- -ㅁ,ㄹㄴ-
-ㅇ,랴- -ㅇ,ㄹㅇ-ㅑ
-ㅇ,려- -ㅇ,ㄹㅇ-ㅕ
-ㅇ,료- -ㅇ,ㄹㅇ-ㅛ
-ㅇ,류- -ㅇ,ㄹㅇ-ㅠ
-ㅇ,ㄹ- -ㅇ,ㄹㄴ-

긔, 기,
늬, 니,
듸, 디,
릐, 리,
믜, 미,
븨, 비,
싀, 시,
즤, 지,
츼, 치,
킈, 키,
틔, 티,
픠, 피,
희, 히,
끠, 끼,
띄, 띠,
쁴, 삐,
씌, 씨,
쯰, 찌,
계, 게,
례, 레,
혜, 헤,

-ㄱㅅ, -ㄱ,
-ㄹㄱ, -ㄱ,
-ㅋ, -ㄱ,
-ㄲ, -ㄱ,
-ㅅ, -ㄷ,
-ㅈ, -ㄷ,
-ㅊ, -ㄷ,
-ㅌ, -ㄷ,
-ㅆ, -ㄷ,
덟, 덜,
-ㄹㅂ, -ㅂ,
-ㄹㅍ, -ㅂ,
-ㅂㅅ, -ㅂ,
-ㅍ, -ㅂ,
-ㄹㅅ, -ㄹ,
-ㄹㅌ, -ㄹ,
-ㄹㅎ, -ㄹ,
-ㄹㅁ, -ㅁ,
-ㄴㅈ, -ㄴ,
-ㄴㅎ, -ㄴ,
-ㅎ,ㅇ- ,ㅇ-
-ㅎ, -ㄷ,

-ㄱ,ㄱ- -ㄱ,ㅅㄱ-
-ㄱ,ㄷ- -ㄱ,ㅅㄷ-
-ㄱ,ㅂ- -ㄱ,ㅅㅂ-
-ㄱ,ㅅ- -ㄱ,ㅅㅆ-
-ㄱ,ㅈ- -ㄱ,ㅅㅈ-
-ㄷ,ㄱ- -ㄷ,ㅅㄱ-
-ㄷ,ㄷ- -ㄷ,ㅅㄷ-
-ㄷ,ㅂ- -ㄷ,ㅅㅂ-
-ㄷ,ㅅ- -ㄷ,ㅅㅆ-
-ㄷ,ㅈ- -ㄷ,ㅅㅈ-
-ㅂ,ㄱ- -ㅂ,ㅅㄱ-
-ㅂ,ㄷ- -ㅂ,ㅅㄷ-
-ㅂ,ㅂ- -ㅂ,ㅅㅂ-
-ㅂ,ㅅ- -ㅂ,ㅅㅆ-
-ㅂ,ㅈ- -ㅂ,ㅅㅈ-
-ㅅ,ㄱ- -ㅅ,ㅅㄱ-
-ㅅ,ㄷ- -ㅅ,ㅅㄷ-
-ㅅ,ㅂ- -ㅅ,ㅅㅂ-
-ㅅ,ㅅ- -ㅅ,ㅅㅆ-
-ㅅ,ㅈ- -ㅅ,ㅅㅈ-
-ㅈ,ㄱ- -ㅈ,ㅅㄱ-
-ㅈ,ㄷ- -ㅈ,ㅅㄷ-
-ㅈ,ㅂ- -ㅈ,ㅅㅂ-
-ㅈ,ㅅ- -ㅈ,ㅅㅆ-
-ㅈ,ㅈ- -ㅈ,ㅅㅈ-


'''
formatting = (
    ('-ㄴㄹ', 'ퟋ'),
    ('-ㄱㄱ', 'ᆩ'),
    ('-ㄱㅅ', 'ᆪ'),
    ('-ㄴㅈ', 'ᆬ'),
    ('-ㄴㅎ', 'ᆭ'),
    ('-ㄹㄱ', 'ᆰ'),
    ('-ㄹㅁ', 'ᆱ'),
    ('-ㄹㅂ', 'ᆲ'),
    ('-ㄹㅅ', 'ᆳ'),
    ('-ㄹㅌ', 'ᆴ'),
    ('-ㄹㅍ', 'ᆵ'),
    ('-ㄹㅎ', 'ᆶ'),
    ('-ㅂㅅ', 'ᆹ'),
    ('-ㄱ', 'ᆨ'),
    ('-ㄲ', 'ᆩ'),
    ('-ㄳ', 'ᆪ'),
    ('-ㄴ', 'ᆫ'),
    ('-ㄵ', 'ᆬ'),
    ('-ㄶ', 'ᆭ'),
    ('-ㄷ', 'ᆮ'),
    ('-ㄹ', 'ᆯ'),
    ('-ㄺ', 'ᆰ'),
    ('-ㄻ', 'ᆱ'),
    ('-ㄼ', 'ᆲ'),
    ('-ㄽ', 'ᆳ'),
    ('-ㄾ', 'ᆴ'),
    ('-ㄿ', 'ᆵ'),
    ('-ㅀ', 'ᆶ'),
    ('-ㅁ', 'ᆷ'),
    ('-ㅂ', 'ᆸ'),
    ('-ㅄ', 'ᆹ'),
    ('-ㅅ', 'ᆺ'),
    ('-ㅆ', 'ᆻ'),
    ('-ㅇ', 'ᆼ'),
    ('-ㅈ', 'ᆽ'),
    ('-ㅊ', 'ᆾ'),
    ('-ㅋ', 'ᆿ'),
    ('-ㅌ', 'ᇀ'),
    ('-ㅍ', 'ᇁ'),
    ('-ㅎ', 'ᇂ'),

    ('ㅅㅅㅅ-', 'ᄴ'),
    ('ㅅㄱ-', 'ᄭ'),
    ('ㅅㄷ-', 'ᄯ'),
    ('ㅅㅂ-', 'ᄲ'),
    ('ㅆㅅ-', 'ᄴ'),
    ('ㅅㅆ-', 'ᄴ'),
    ('ㅅㅈ-', 'ᄶ'),
    ('ㄹㄹ-', 'ᄙ'),
    ('ㄹㄴ-', 'ᄘ'),
    ('ㄹㅇ-', 'ᄛ'),
    ('ㄱㄱ-', 'ᄁ'),
    ('ㄷㄷ-', 'ᄄ'),
    ('ㅂㅂ-', 'ᄈ'),
    ('ㅅㅅ-', 'ᄊ'),
    ('ㅈㅈ-', 'ᄍ'),
    ('ㄴㅎ-', 'ᅝ'),
    ('ㄹㅎ-', 'ᄚ'),
    ('ㅁㅎ-', 'ᄝ'),
    ('ㄱ-', 'ᄀ'),
    ('ㄲ-', 'ᄁ'),
    ('ㄴ-', 'ᄂ'),
    ('ㄷ-', 'ᄃ'),
    ('ㄸ-', 'ᄄ'),
    ('ㄹ-', 'ᄅ'),
    ('ㅁ-', 'ᄆ'),
    ('ㅂ-', 'ᄇ'),
    ('ㅃ-', 'ᄈ'),
    ('ㅅ-', 'ᄉ'),
    ('ㅆ-', 'ᄊ'),
    ('ㅇ-', 'ᄋ'),
    ('ㅈ-', 'ᄌ'),
    ('ㅉ-', 'ᄍ'),
    ('ㅊ-', 'ᄎ'),
    ('ㅋ-', 'ᄏ'),
    ('ㅌ-', 'ᄐ'),
    ('ㅍ-', 'ᄑ'),
    ('ㅎ-', 'ᄒ'),

    ('ㅏ', 'ᅡ'),
    ('ㅐ', 'ᅢ'),
    ('ㅑ', 'ᅣ'),
    ('ㅒ', 'ᅤ'),
    ('ㅓ', 'ᅥ'),
    ('ㅔ', 'ᅦ'),
    ('ㅕ', 'ᅧ'),
    ('ㅖ', 'ᅨ'),
    ('ㅗ', 'ᅩ'),
    ('ㅘ', 'ᅪ'),
    ('ㅙ', 'ᅫ'),
    ('ㅚ', 'ᅬ'),
    ('ㅛ', 'ᅭ'),
    ('ㅜ', 'ᅮ'),
    ('ㅝ', 'ᅯ'),
    ('ㅞ', 'ᅰ'),
    ('ㅟ', 'ᅱ'),
    ('ㅠ', 'ᅲ'),
    ('ㅡ', 'ᅳ'),
    ('ㅢ', 'ᅴ'),
    ('ㅣ', 'ᅵ'),
)

for f in formatting:
    rule = rule.replace(f[0], f[1])
rule = decompose(rule)

changes = []

for line in rule.split('\n'):
    if line != '':
        changes.append((line.split(' ')[0].split(','), line.split(' ')[1].split(',')))

def convert(text: str) -> str:
    text = decompose(text)
    for change in changes:
        text = text.replace(change[0][0]+change[0][1], change[1][0]+change[1][1])
        text = text.replace(change[0][0]+'_'+change[0][1], change[1][0]+' '+change[1][1])
    for change in changes:
        text = text.replace(change[0][0]+'+'+change[0][1], change[1][0]+change[1][1])
    return text

if __name__ == '__main__':
    print('\n'.join(convert(input('입력: '))))
