from decomposer import decompose

rule='''

-ㄷ,이 ,지
-ㅌ,이 ,치
-ㄹㅌ,이 -ㄹ,치
-ㄷ,히 ,치

-ㄱ,ㅇ- ,ㄱ-
-ㄴ,ㅇ- ,ㄴ-
-ㄷ,ㅇ- ,ㄷ-
-ㄹ,ㅇ- ,ㄹ-
-ㅁ,ㅇ- ,ㅁ-
-ㅂ,ㅇ- ,ㅂ-
-ㅅ,ㅇ- ,ㅅ-
-ㅈ,ㅇ- ,ㅈ-
-ㅊ,ㅇ- ,ㅊ-
-ㅋ,ㅇ- ,ㅋ-
-ㅌ,ㅇ- ,ㅌ-
-ㅍ,ㅇ- ,ㅍ-
-ㄲ,ㅇ- ,ㄲ-
-ㅆ,ㅇ- ,ㅆ-

계, 게,
례, 레,
혜, 헤,

-ㄹㅂ,ㄱ- -ㄹ,ㅅㄱ-
-ㄹㅂ,ㄷ- -ㅂ,ㅅㄷ-
-ㄹㅂ,ㅅ- -ㅂ,ㅅㅅ-
-ㄹㅂ,ㅈ- -ㅂ,ㅅㅈ-
-ㄹㄱ,ㄱ- -ㄹ,ㅅㄱ-

-ㄱㅅ,ㅇ- -ㄱ,ㅅ-
-ㄹㄱ,ㅇ- -ㄹ,ㄱ-
-ㄹㅂ,ㅇ- -ㄹ,ㅂ-
-ㄹㅍ,ㅇ- -ㄹ,ㅍ-
-ㅂㅅ,ㅇ- -ㅂ,ㅅ-
-ㄹㅌ,ㅇ- -ㄹ,ㅌ-
-ㄹㅌ,ㄱ- -ㄹ,ㅅㄱ-
-ㄹㅌ,ㄷ- -ㅌ,ㅅㄷ-
-ㄹㅌ,ㅂ- -ㅌ,ㅅㅂ-
-ㄹㅌ,ㅅ- -ㅌ,ㅅㅆ-
-ㄹㅌ,ㅈ- -ㅌ,ㅅㅈ-
-ㄴㅈ,ㅇ- -ㄴ,ㅈ-
-ㄹㅎ,ㅇ- -ㄹ,ㅎ-
-ㄹㅎ,ㄱ- -ㄹ,ㅋ-
-ㄹㅎ,ㄴ- -ㄹ,ㄹㄹ-
-ㄹㅎ,ㄷ- -ㄹ,ㅌ-
옰,바 올,바
-ㄹㅎ,ㅅ- -ㄹ,ㅅㅆ-
-ㄹㅎ,ㅈ- -ㄹ,ㅅㅊ-
-ㄹㅁ,ㅇ- -ㄹ,ㅁ-
-ㄹㅁ,ㄱ- -ㅁ,ㅅㄱ-
-ㄹㅁ,ㄷ- -ㅁ,ㅅㄷ-
-ㄹㅁ,ㅂ- -ㅁ,ㅅㅂ-
-ㄹㅁ,ㅅ- -ㅁ,ㅅㅆ-
-ㄹㅁ,ㅈ- -ㅁ,ㅅㅈ-
-ㄴㅈ,ㅇ- -ㄴ,ㅈ-
-ㄴㅈ,ㄱ- -ㄴ,ㅅㄱ-
-ㄴㅈ,ㄷ- -ㄴ,ㅅㄷ-
-ㄴㅈ,ㅂ- -ㄴ,ㅅㅂ-
-ㄴㅈ,ㅅ- -ㄴ,ㅅㅆ-
-ㄴㅈ,ㅈ- -ㄴ,ㅅㅈ-
-ㄴㅎ,ㅇ- ,ㄴ-
-ㄴㅎ,ㄱ- -ㄴ,ㅋ-
-ㄴㅎ,ㄷ- -ㄴ,ㅌ-
-ㄴㅎ,ㅂ- -ㄴ,ㅍ-
-ㄴㅎ,ㅅ- -ㄴ,ㅅㅆ-
-ㄴㅎ,ㅈ- -ㄴ,ㅅㅈ-
-ㅎ,ㄱ- -ㄷ,ㅋ-
-ㅎ,ㄷ- -ㄷ,ㅌ-
-ㅎ,ㅂ- -ㄷ,ㅍ-
-ㅎ,ㅅ- -ㄷ,ㅅㅆ-
-ㅎ,ㅈ- -ㄷ,ㅅㅈ-
-ㅎ,ㄴ- -ㄴ,ㄴ-

-ㄱ,ㅎ- ,ㅋ-
-ㄷ,ㅎ- ,ㅌ-
-ㅂ,ㅎ- ,ㅍ-
-ㅈ,ㅎ- ,ㅊ-
-ㄴㅈ,ㅎ- -ㄴ,ㅊ-
-ㄹㄱ,ㅎ- -ㄹ,ㅋ-
-ㄹㅂ,ㅎ- -ㄹ,ㅍ-

-ㄴ,ㅎ- ,ㄴㅎ-
-ㄹ,ㅎ- ,ㄹㅎ-
-ㅁ,ㅎ- ,ㅁㅎ-

-ㄱ,ㄴ- -ㅇ,ㄴ-
-ㄱ,ㅁ- -ㅇ,ㅁ-
-ㄱ,ㄹ- -ㅇ,ㄹㄴ-
-ㄱㅅ,ㄴ- -ㄱ,ㄴ-
-ㄱㅅ,ㅁ- -ㄱ,ㅁ-
-ㄱㅅ,ㄹ- -ㄱ,ㄹㄴ-
-ㅋ,ㄴ- -ㅇ,ㄴ-
-ㅋ,ㅁ- -ㅇ,ㅁ-
-ㅋ,ㄹ- -ㅇ,ㄹㄴ-
-ㄲ,ㄴ- -ㅇ,ㄴ-
-ㄲ,ㅁ- -ㅇ,ㅁ-
-ㄲ,ㄹ- -ㅇ,ㄹㄴ-
-ㄹㄱ,ㄴ- -ㄹ,ㄴ-
-ㄹㄱ,ㅁ- -ㄹ,ㅁ-
-ㄹㄱ,ㄹ- -ㄹ,ㄹㄴ-

-ㄷ,ㄴ- -ㄴ,ㄴ-
-ㄷ,ㅁ- -ㄴ,ㅁ-
-ㄷ,ㄹ- -ㄴ,ㄹㄴ-
-ㅅ,ㄴ- -ㄴ,ㄴ-
-ㅅ,ㅁ- -ㄴ,ㅁ-
-ㅅ,ㄹ- -ㄴ,ㄹㄴ-
-ㅈ,ㄴ- -ㄴ,ㄴ-
-ㅈ,ㅁ- -ㄴ,ㅁ-
-ㅈ,ㄹ- -ㄴ,ㄹㄴ-
-ㅊ,ㄴ- -ㄴ,ㄴ-
-ㅊ,ㅁ- -ㄴ,ㅁ-
-ㅊ,ㄹ- -ㄴ,ㄹㄴ-
-ㅌ,ㄴ- -ㄴ,ㄴ-
-ㅌ,ㅁ- -ㄴ,ㅁ-
-ㅌ,ㄹ- -ㄴ,ㄹㄴ-
-ㅆ,ㄴ- -ㄴ,ㄴ-
-ㅆ,ㅁ- -ㄴ,ㅁ-
-ㅆ,ㄹ- -ㄴ,ㄹㄴ-

-ㄹㅂ,ㄴ- -ㅁ,ㄴ-
-ㄹㅂ,ㅁ- -ㅁ,ㅁ-
-ㄹㅂ,ㄹ- -ㅁ,ㄹㄴ-
-ㅂ,ㄴ- -ㅁ,ㄴ-
-ㅂ,ㅁ- -ㅁ,ㅁ-
-ㅂ,ㄹ- -ㅁ,ㄹㄴ-
-ㅂㅅ,ㄴ- -ㅁ,ㄴ-
-ㅂㅅ,ㅁ- -ㅁ,ㅁ-
-ㅂㅅ,ㄹ- -ㅁ,ㄹㄴ-
-ㅍ,ㄴ- -ㅁ,ㄴ-
-ㅍ,ㅁ- -ㅁ,ㅁ-
-ㅍ,ㄹ- -ㅁ,ㄹㄴ-

-ㄹ,ㄴ- -ㄹ,ㄹㄹ-
-ㄴ,ㄹ- -ㄴㄹ,ㄹㄹ-

-ㅁ,랴- -ㅁ,ㄹㅇ-ㅑ
-ㅁ,려- -ㅁ,ㄹㅇ-ㅕ
-ㅁ,료- -ㅁ,ㄹㅇ-ㅛ
-ㅁ,류- -ㅁ,ㄹㅇ-ㅠ
-ㅁ,ㄹ- -ㅁ,ㄹㄴ-
-ㅇ,랴- -ㅇ,ㄹㅇ-ㅑ
-ㅇ,려- -ㅇ,ㄹㅇ-ㅕ
-ㅇ,료- -ㅇ,ㄹㅇ-ㅛ
-ㅇ,류- -ㅇ,ㄹㅇ-ㅠ
-ㅇ,ㄹ- -ㅇ,ㄹㄴ-

긔, 기,
늬, 니,
듸, 디,
릐, 리,
믜, 미,
븨, 비,
싀, 시,
즤, 지,
츼, 치,
킈, 키,
틔, 티,
픠, 피,
희, 히,
끠, 끼,
띄, 띠,
쁴, 삐,
씌, 씨,
쯰, 찌,
계, 게,
례, 레,
혜, 헤,

-ㄱㅅ, -ㄱ,
-ㄹㄱ, -ㄱ,
-ㅋ, -ㄱ,
-ㄲ, -ㄱ,
-ㅅ, -ㄷ,
-ㅈ, -ㄷ,
-ㅊ, -ㄷ,
-ㅌ, -ㄷ,
-ㅆ, -ㄷ,
덟, 덜,
-ㄹㅂ, -ㅂ,
-ㄹㅍ, -ㅂ,
-ㅂㅅ, -ㅂ,
-ㅍ, -ㅂ,
-ㄹㅅ, -ㄹ,
-ㄹㅌ, -ㄹ,
-ㄹㅎ, -ㄹ,
-ㄹㅁ, -ㅁ,
-ㄴㅈ, -ㄴ,
-ㄴㅎ, -ㄴ,
-ㅎ,ㅇ- ,ㅇ-
-ㅎ, -ㄷ,ㅈ
'''
formatting = (
    ('-ㄴㄹ', 'ퟋ'),
    ('-ㄱㄱ', 'ᆩ'),
    ('-ㄱㅅ', 'ᆪ'),
    ('-ㄴㅈ', 'ᆬ'),
    ('-ㄴㅎ', 'ᆭ'),
    ('-ㄹㄱ', 'ᆰ'),
    ('-ㄹㅁ', 'ᆱ'),
    ('-ㄹㅂ', 'ᆲ'),
    ('-ㄹㅅ', 'ᆳ'),
    ('-ㄹㅌ', 'ᆴ'),
    ('-ㄹㅍ', 'ᆵ'),
    ('-ㄹㅎ', 'ᆶ'),
    ('-ㅂㅅ', 'ᆹ'),
    ('-ㄱ', 'ᆨ'),
    ('-ㄲ', 'ᆩ'),
    ('-ㄳ', 'ᆪ'),
    ('-ㄴ', 'ᆫ'),
    ('-ㄵ', 'ᆬ'),
    ('-ㄶ', 'ᆭ'),
    ('-ㄷ', 'ᆮ'),
    ('-ㄹ', 'ᆯ'),
    ('-ㄺ', 'ᆰ'),
    ('-ㄻ', 'ᆱ'),
    ('-ㄼ', 'ᆲ'),
    ('-ㄽ', 'ᆳ'),
    ('-ㄾ', 'ᆴ'),
    ('-ㄿ', 'ᆵ'),
    ('-ㅀ', 'ᆶ'),
    ('-ㅁ', 'ᆷ'),
    ('-ㅂ', 'ᆸ'),
    ('-ㅄ', 'ᆹ'),
    ('-ㅅ', 'ᆺ'),
    ('-ㅆ', 'ᆻ'),
    ('-ㅇ', 'ᆼ'),
    ('-ㅈ', 'ᆽ'),
    ('-ㅊ', 'ᆾ'),
    ('-ㅋ', 'ᆿ'),
    ('-ㅌ', 'ᇀ'),
    ('-ㅍ', 'ᇁ'),
    ('-ㅎ', 'ᇂ'),

    ('ㅅㅅㅅ-', 'ᄴ'),
    ('ㅅㄱ-', 'ᄭ'),
    ('ㅅㄷ-', 'ᄯ'),
    ('ㅅㅂ-', 'ᄲ'),
    ('ㅆㅅ-', 'ᄴ'),
    ('ㅅㅆ-', 'ᄴ'),
    ('ㅅㅈ-', 'ᄶ'),
    ('ㄹㄹ-', 'ᄙ'),
    ('ㄹㄴ-', 'ᄘ'),
    ('ㄹㅇ-', 'ᄛ'),
    ('ㄱㄱ-', 'ᄁ'),
    ('ㄷㄷ-', 'ᄄ'),
    ('ㅂㅂ-', 'ᄈ'),
    ('ㅅㅅ-', 'ᄊ'),
    ('ㅈㅈ-', 'ᄍ'),
    ('ㄴㅎ-', 'ᅝ'),
    ('ㄹㅎ-', 'ᄚ'),
    ('ㅁㅎ-', 'ᄝ'),
    ('ㄱ-', 'ᄀ'),
    ('ㄲ-', 'ᄁ'),
    ('ㄴ-', 'ᄂ'),
    ('ㄷ-', 'ᄃ'),
    ('ㄸ-', 'ᄄ'),
    ('ㄹ-', 'ᄅ'),
    ('ㅁ-', 'ᄆ'),
    ('ㅂ-', 'ᄇ'),
    ('ㅃ-', 'ᄈ'),
    ('ㅅ-', 'ᄉ'),
    ('ㅆ-', 'ᄊ'),
    ('ㅇ-', 'ᄋ'),
    ('ㅈ-', 'ᄌ'),
    ('ㅉ-', 'ᄍ'),
    ('ㅊ-', 'ᄎ'),
    ('ㅋ-', 'ᄏ'),
    ('ㅌ-', 'ᄐ'),
    ('ㅍ-', 'ᄑ'),
    ('ㅎ-', 'ᄒ'),

    ('ㅏ', 'ᅡ'),
    ('ㅐ', 'ᅢ'),
    ('ㅑ', 'ᅣ'),
    ('ㅒ', 'ᅤ'),
    ('ㅓ', 'ᅥ'),
    ('ㅔ', 'ᅦ'),
    ('ㅕ', 'ᅧ'),
    ('ㅖ', 'ᅨ'),
    ('ㅗ', 'ᅩ'),
    ('ㅘ', 'ᅪ'),
    ('ㅙ', 'ᅫ'),
    ('ㅚ', 'ᅬ'),
    ('ㅛ', 'ᅭ'),
    ('ㅜ', 'ᅮ'),
    ('ㅝ', 'ᅯ'),
    ('ㅞ', 'ᅰ'),
    ('ㅟ', 'ᅱ'),
    ('ㅠ', 'ᅲ'),
    ('ㅡ', 'ᅳ'),
    ('ㅢ', 'ᅴ'),
    ('ㅣ', 'ᅵ'),
)

for f in formatting:
    rule = rule.replace(f[0], f[1])
rule = decompose(rule)

changes = []

for line in rule.split('\n'):
    if line != '':
        changes.append((line.split(' ')[0].split(','), line.split(' ')[1].split(',')))

def convert(text: str) -> str:
    text = decompose(text)
    for change in changes:
        text = text.replace(change[0][0]+change[0][1], change[1][0]+change[1][1])
    return text

if __name__ == '__main__':
    print('\n'.join(convert(input('입력: '))))
